[
    {
        "id": 2450,
        "question": "Give me a count of everything made by the company which offers electronical manufacturing too.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Electronics_manufacturing_services",
        "entity1_mention": "electronical manufacturing",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Company"
        ]
    },
    {
        "id": 2512,
        "question": "Name a few whose live in a place where Indian English is an official language",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Indian_English",
        "entity1_mention": "Indian English",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/HistoricPlace",
            "http://dbpedia.org/ontology/Place",
            "http://dbpedia.org/ontology/Location"
        ]
    },
    {
        "id": 2599,
        "question": "What fictional character's species is American Pekin duck",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> } ",
        "entity1_uri": "http://dbpedia.org/resource/American_Pekin_duck",
        "entity1_mention": "american pekin duck",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2629,
        "question": "Where did ed podolak go to high school",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/Ed_Podolak",
        "entity1_mention": "ed podolak",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2633,
        "question": "Count all those whose youth club was managed by Luis Enrique.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Luis_Enrique_(footballer)",
        "entity1_mention": "Luis Enrique",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2654,
        "question": "List all those whose relatives' nationality is United States.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/United_States",
        "entity1_mention": "United States",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2666,
        "question": "Name some books by Spanish speaking authors.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Spanish_language",
        "entity1_mention": "spanish",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2710,
        "question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Malaysian_Chinese_Association",
        "entity1_mention": "Malaysian and Chinese association",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2791,
        "question": "With which musical artist is the music group which sung Mind Blowin' related to ?  ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)",
        "entity1_mention": "sung Mind Blowin",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/MusicalArtist",
            "http://dbpedia.org/ontology/EthnicGroup",
            "http://dbpedia.org/ontology/Group"
        ]
    },
    {
        "id": 2902,
        "question": "Name a famous relative of barry voight",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Barry_Voight",
        "entity1_mention": "barry voight",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2941,
        "question": "What is the common award won by Charles LeMaire and Eric Roth",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Eric_Roth> <http://dbpedia.org/ontology/award> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/Charles_LeMaire",
        "entity1_mention": "Charles LeMaire",
        "entity2_uri": "http://dbpedia.org/resource/Eric_Roth",
        "entity2_mention": "Eric Roth",
        "cand_types": []
    },
    {
        "id": 3029,
        "question": "For which team did both Butch Metzger and Brian Horwitz debuted ? ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Brian_Horwitz> <http://dbpedia.org/ontology/debutTeam> ?uri . }",
        "entity1_uri": "http://dbpedia.org/resource/Butch_Metzger",
        "entity1_mention": "Butch Metzger",
        "entity2_uri": "http://dbpedia.org/resource/Brian_Horwitz",
        "entity2_mention": "Brian Horwitz",
        "cand_types": []
    },
    {
        "id": 3159,
        "question": "Who all have been canonized by Pope Paul VI",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } ",
        "entity1_uri": "http://dbpedia.org/resource/Pope_Paul_VI",
        "entity1_mention": "pope paul vi",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 3172,
        "question": "Give me the count of artist in the company whose Artist is Jean Fran\u00e7ois Cot\u00e9 ?",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }",
        "entity1_uri": "http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9",
        "entity1_mention": "Jean Fran\u00e7ois Cot\u00e9",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Company",
            "http://dbpedia.org/ontology/MusicalArtist",
            "http://dbpedia.org/ontology/MartialArtist",
            "http://dbpedia.org/ontology/Artist"
        ]
    },
    {
        "id": 3215,
        "question": "Which sport of Vishwajyot High School is also the genere of Battle chess ",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Battle_Chess> <http://dbpedia.org/property/genre> ?uri. <http://dbpedia.org/resource/Vishwajyot_High_School> <http://dbpedia.org/ontology/sport> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/Battle_Chess",
        "entity1_mention": "battle chess",
        "entity2_uri": "http://dbpedia.org/resource/Vishwajyot_High_School",
        "entity2_mention": "vishwajyot high school",
        "cand_types": []
    },
    {
        "id": 3320,
        "question": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens",
        "entity1_mention": "National and Kapodistrian University of Athens",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Person",
            "http://dbpedia.org/ontology/Award"
        ]
    },
    {
        "id": 3427,
        "question": "is Mazhar Ul Haq High School Beerwah is affiliated to Islamic Religion",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }",
        "entity1_uri": "http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah",
        "entity1_mention": "Mazhar Ul Haq High School Beerwah",
        "entity2_uri": "http://dbpedia.org/resource/Islam",
        "entity2_mention": "Islamic Religion",
        "cand_types": []
    },
    {
        "id": 3467,
        "question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong",
        "entity1_mention": "monroe gilchrist",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    }
]