[
    {
        "id": 30,
        "question": "Name the mascot of the military branch of William Harper.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)",
        "entity1_mention": "William Harper.",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 58,
        "question": "Which tenants of the Master Card center is also th draft team of Sam Carrick ",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/MasterCard_Centre",
        "entity1_mention": "Master Card center",
        "entity2_uri": "http://dbpedia.org/resource/Sam_Carrick",
        "entity2_mention": "Sam Carrick",
        "cand_types": []
    },
    {
        "id": 73,
        "question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Oj,_svijetla_majska_zoro",
        "entity1_mention": "Oj, svijetla majska zoro",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 100,
        "question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }",
        "entity1_uri": "http://dbpedia.org/resource/Roundhead_(Wyandot)",
        "entity1_mention": "Roundhead (Wyandot).",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 122,
        "question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Rosario,_Santa_Fe",
        "entity1_mention": "the Rosario, Santa Fe stadium",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 125,
        "question": "Count all the different purposes followed by the different NGOs.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization> . ?x <http://dbpedia.org/property/purpose> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Non-governmental_organization",
        "entity1_mention": "NGOs",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 128,
        "question": "Did Steve Sampson manage a club of Santa Clara university",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }",
        "entity1_uri": "http://dbpedia.org/resource/Steve_Sampson",
        "entity1_mention": "Steve Sampson",
        "entity2_uri": "http://dbpedia.org/resource/Santa_Clara_University",
        "entity2_mention": "Santa Clara university",
        "cand_types": []
    },
    {
        "id": 129,
        "question": "What newspapers's owners is Schibsted",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
        "entity1_uri": "http://dbpedia.org/resource/Schibsted",
        "entity1_mention": "schibsted",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Newspaper"
        ]
    },
    {
        "id": 200,
        "question": "Count the number of religions followed by the alumini of Ananda College.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Ananda_College> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Ananda_College",
        "entity1_mention": "Ananda College",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 223,
        "question": "Name the largest city in the county where there is a Cy-Fair High School.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cy-Fair_High_School> <http://dbpedia.org/ontology/county> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Cy-Fair_High_School",
        "entity1_mention": "cy-fair",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 237,
        "question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Mecklenburg-Vorpommern",
        "entity1_mention": "Mecklenburg-Vorpommern",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 239,
        "question": "Count the number of actors in Lucy Sullivan Is Getting Married.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married",
        "entity1_mention": "Lucy Sullivan Is Getting Married",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 245,
        "question": "Count all the scientologists.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Scientology",
        "entity1_mention": "scientologists",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 309,
        "question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Papeete",
        "entity1_mention": "papeete",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 401,
        "question": "Who coached the marquet golden eagels during 2013",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team",
        "entity1_mention": "marquet golden eagels during 2013",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 463,
        "question": "Name the members of youth clubs which have Camp Nou as their homeground.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Camp_Nou",
        "entity1_mention": "camp nou",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/SoccerClub"
        ]
    },
    {
        "id": 500,
        "question": "What writers have nationality as Statelessness?  ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "entity1_uri": "http://dbpedia.org/resource/Statelessness",
        "entity1_mention": "Statelessness",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Writer"
        ]
    },
    {
        "id": 580,
        "question": "List the successor of successor of Hayden, Stone & Co.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hayden,_Stone_&_Co.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/successor> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Hayden,_Stone_&_Co.",
        "entity1_mention": "hayden, stone & co",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 616,
        "question": "list some companies founded by Jim Harris.",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)> } ",
        "entity1_uri": "http://dbpedia.org/resource/Jim_Harris_(entrepreneur)",
        "entity1_mention": "Jim Harris",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Company"
        ]
    },
    {
        "id": 706,
        "question": "Who is the spouse of Daniel Gibson? ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Daniel_Gibson",
        "entity1_mention": "Daniel Gibson",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 740,
        "question": "Name all the bands which have members of QDT in them.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/QDT> <http://dbpedia.org/ontology/bandMember> ?x . ?x <http://dbpedia.org/ontology/associatedBand> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/QDT",
        "entity1_mention": "qdt",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 779,
        "question": "Count the awards given to the recepients of the Becket fund for religious liberty.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty",
        "entity1_mention": "Becket fund for religious liberty",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Award"
        ]
    },
    {
        "id": 877,
        "question": "Count all the things licensed as Software as a service.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Software_as_a_service",
        "entity1_mention": "Software as a service",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 906,
        "question": "Who is married to Tony Ramo",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Tony_Romo",
        "entity1_mention": "Tony Ramo",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 909,
        "question": "Who wrote Heroman?",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/Heroman",
        "entity1_mention": "heroman",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 932,
        "question": "List the awards given to the relatives of Gregorios Bernardakis.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Gregorios_Bernardakis",
        "entity1_mention": "Gregorios Bernardakis",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Award"
        ]
    },
    {
        "id": 933,
        "question": "Count all the games whose distributors are located in America",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/United_States",
        "entity1_mention": "America",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 991,
        "question": "What are some apes?",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Ape",
        "entity1_mention": "apes",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1022,
        "question": "What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._T._Krogh> <http://dbpedia.org/ontology/nationality> ?uri. <http://dbpedia.org/resource/Camilla_Martin> <http://dbpedia.org/ontology/country> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/J._T._Krogh",
        "entity1_mention": "J. T. Krogh",
        "entity2_uri": "http://dbpedia.org/resource/Camilla_Martin",
        "entity2_mention": "camilla martin",
        "cand_types": []
    },
    {
        "id": 1052,
        "question": "Is Microsoft office written in C++",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }",
        "entity1_uri": "http://dbpedia.org/resource/Microsoft_Office",
        "entity1_mention": "microsoft office",
        "entity2_uri": "http://dbpedia.org/resource/C++",
        "entity2_mention": "c++",
        "cand_types": []
    },
    {
        "id": 1063,
        "question": "Which administrative headquarters of the Pulau Ubin is also the resting place of the Nicole Lai",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pulau_Ubin> <http://dbpedia.org/ontology/capital> ?uri. <http://dbpedia.org/resource/Nicole_Lai> <http://dbpedia.org/ontology/restingPlace> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/Pulau_Ubin",
        "entity1_mention": "pulau ubin",
        "entity2_uri": "http://dbpedia.org/resource/Nicole_Lai",
        "entity2_mention": "nicole lai",
        "cand_types": []
    },
    {
        "id": 1104,
        "question": " Count the participants of the NBA.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }",
        "entity1_uri": "http://dbpedia.org/resource/National_Basketball_Association",
        "entity1_mention": "NBA",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1137,
        "question": "Count the number of religions followed by Janta Dal members.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Janata_Dal",
        "entity1_mention": "Janta Dal",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1207,
        "question": "Is lion an animal?",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }",
        "entity1_uri": "http://dbpedia.org/resource/Lion",
        "entity1_mention": "lion",
        "entity2_uri": "http://dbpedia.org/resource/Animal",
        "entity2_mention": "animal",
        "cand_types": []
    },
    {
        "id": 1226,
        "question": "Count the number of judges who've come on CTV network shows.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/CTV_Television_Network",
        "entity1_mention": "CTV network shows",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1234,
        "question": "?What are the airline hubs of Cascade Airways",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/Cascade_Airways",
        "entity1_mention": "cascade airways",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Airline"
        ]
    },
    {
        "id": 1245,
        "question": "Name some people working at someplace owned by News Corp.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/News_Corp",
        "entity1_mention": "News Corp",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1262,
        "question": "what are some journals of academic Philosophy",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> } ",
        "entity1_uri": "http://dbpedia.org/resource/Philosophy",
        "entity1_mention": "philosophy",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1273,
        "question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/SummerSlam_(2004)",
        "entity1_mention": "summer slam 2004",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Stadium"
        ]
    },
    {
        "id": 1358,
        "question": "List the products of the company which published Tweenies: Game Time.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tweenies:_Game_Time> <http://dbpedia.org/property/publisher> ?x . ?x <http://dbpedia.org/property/products> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Tweenies:_Game_Time",
        "entity1_mention": "tweenies: game time",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1472,
        "question": "Count the different causes of death of Christians.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Christianity",
        "entity1_mention": "Christians",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1496,
        "question": "Give me the characters who last appeared in Star Wars Episode 3",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } ",
        "entity1_uri": "http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith",
        "entity1_mention": "star wars episode 3",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1587,
        "question": "Count the different alma maters of people employed by the CNN",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/CNN",
        "entity1_mention": "cnn",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1616,
        "question": "List everything in which saxophone players have been casted.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Saxophone",
        "entity1_mention": "saxophone",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1680,
        "question": "What stadium's operator is Stan Kroenke",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Stan_Kroenke>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}",
        "entity1_uri": "http://dbpedia.org/resource/Stan_Kroenke",
        "entity1_mention": "stan kroenke",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Stadium"
        ]
    },
    {
        "id": 1688,
        "question": "Count all the places where companies located in Ontario operate.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Ontario",
        "entity1_mention": "ontario",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1739,
        "question": "Give me some softwares which run on mac os",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
        "entity1_uri": "http://dbpedia.org/resource/Mac_OS",
        "entity1_mention": "mac os",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Software"
        ]
    },
    {
        "id": 1761,
        "question": "Count the number of families of the Animal kingdom.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> . ?x <http://dbpedia.org/ontology/family> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Animal",
        "entity1_mention": "animal",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1774,
        "question": "Count the total religions followed by the ones living in England.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/England",
        "entity1_mention": "England",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1913,
        "question": "Who did Bruce Bochy play for ? ",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/Bruce_Bochy",
        "entity1_mention": "bruce bochy",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Play"
        ]
    },
    {
        "id": 1959,
        "question": "Name all those buried in a place governed by a city council.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/governingBody> <http://dbpedia.org/resource/City_council> . ?uri <http://dbpedia.org/property/restingPlace> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/City_council",
        "entity1_mention": "city council",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 1981,
        "question": "Give me the count of all the names of characters created by Frank Miller",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Frank_Miller_(comics)> . ?x <http://dbpedia.org/property/characterName> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Frank_Miller_(comics)",
        "entity1_mention": "Frank Miller",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/FictionalCharacter",
            "http://dbpedia.org/ontology/ComicsCharacter"
        ]
    },
    {
        "id": 2075,
        "question": "Count the number of religions followed by BJP members.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Bharatiya_Janata_Party",
        "entity1_mention": "BJP",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2146,
        "question": "Name everyone working for a company owned by Roman Abramovich.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }",
        "entity1_uri": "http://dbpedia.org/resource/Roman_Abramovich",
        "entity1_mention": "Roman Abramovich",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Company"
        ]
    },
    {
        "id": 2159,
        "question": "List the awards won by the wife of Ingrid von Rosen.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "entity1_uri": "http://dbpedia.org/resource/Ingrid_von_Rosen",
        "entity1_mention": "Ingrid von Rosen",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2223,
        "question": "Count the drinks originated in England.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}",
        "entity1_uri": "http://dbpedia.org/resource/England",
        "entity1_mention": "England",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": [
            "http://dbpedia.org/ontology/Beverage"
        ]
    },
    {
        "id": 2265,
        "question": "in which movies have momoki kochi acted",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Momoko_K\u014dchi> } ",
        "entity1_uri": "http://dbpedia.org/resource/Momoko_K\u014dchi",
        "entity1_mention": "momoki kochi",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2314,
        "question": "What is a salthill?",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ",
        "entity1_uri": "http://dbpedia.org/resource/Salthill",
        "entity1_mention": "salthill",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2344,
        "question": "What is the venerated in of the Abraham and religion of the Saima Chowdhury",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abraham> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/property/religion> ?uri} ",
        "entity1_uri": "http://dbpedia.org/resource/Abraham",
        "entity1_mention": "abraham",
        "entity2_uri": "http://dbpedia.org/resource/Saima_Chowdhury",
        "entity2_mention": "Saima Chowdhury",
        "cand_types": []
    },
    {
        "id": 2418,
        "question": "Count the  origin of the beverages which have been originated in england /",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }",
        "entity1_uri": "http://dbpedia.org/resource/England",
        "entity1_mention": "england",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    },
    {
        "id": 2427,
        "question": "Count all the stateless people",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Statelessness>  . }",
        "entity1_uri": "http://dbpedia.org/resource/Statelessness",
        "entity1_mention": "stateless",
        "entity2_uri": "",
        "entity2_mention": "",
        "cand_types": []
    }
]